//	parameters.json:
//	2021.4.4
//	解释：
//	1	PA0001	性别
//	2	PA0002	星期
//	3	PA0003	教练分类
//	4	PA0004	肤色
//	5	PA0005	身份证件种类
//	6	PA0006	短期营商品类型
//	7	PA0007	赛事商品报名类型
//	8	PA0008	活动商品报名类型
//	9	PA0009	运动类目
//	10	PA0010	卡的期限
//	11	PA0011	商品状态
//	12	PA0012	订单状态
//	13	PA0013	计量单位
//	14	PA0014	资讯分类
//	15	PA0015	签到类型
//	16	PA0016	客户沟通方式
//	17	PA0017	线下渠道来源
//	18	PA0018	线上渠道来源
//	19	PA0019	客户信息池
//	20	PA0020	菜单状态
//	21	PA0021	API接口调用入口属性
//	22	PA0022	API接口返回参数类型
//	23	PA0023	请求方式
//	24	PA0024	接口类型
//	25	PA0025	用户状态
//	26	PA0026	会员状态
//	27	PA0027	教练状态
//	28	PA0028	资讯状态
//	29	PA0029	排课状态
//	30	PA0030	客户状态
//	31	PA0031	上下午
//	32	PA0032	半小时
//	33	PA0033	一小时
//	34	PA0034	两小时
//	35	PA0035	时
//	36	PA0036	分
//	37	PA0037	用户分类
//	38	PA0038	血型
//	39	PA0039	会员分类
//	40	PA0040	民族
//	41	PA0041	籍贯
//	42	PA0042	合作方式
//	43	PA0043	可运营商品
//	44	PA0044	教练状态
module.exports = {
  'PA0001': ['男', '女'],
  'PA0002': ['星期一', '星期二', '星期三', '星期四', '星期五', '星期六', '星期日'],
  'PA0003': ['外教', '中教'],
  'PA0004': ['黄', '黑', '白'],
  'PA0005': ['身份证号', '护照号码', '通行证号'],
  'PA0006': ['走训营', '封闭营'],
  'PA0007': ['个人', '球队'],
  'PA0008': ['个人', '团体'],
  'PA0009': ['足球', '篮球', '游泳', '美式橄榄球', '棒球', '高尔夫', '体适能'],
  'PA0010': ['年卡', '半年卡', '季卡', '月卡'],
  'PA0011': {  10: '上架审核中', 20: '驳回', 30: '已上架', 40: '下架' },
  'PA0048': {'上架审核中': 10, '驳回': 20, '已上架': 30,  '下架': 40},
  'PA0012': { 0: '草稿', 10: '未付款', 20: '已付款', 30: '已排课', 40: '已结课', 50: '已转课' },
  'PA0013': ['份', '件', '个', '双', '台', '块', '节'],
  'PA0014': ['文章', '通知', '通告'],
  'PA0015': ['已上课', '事假', '病假', '旷课', '天气原因停课', '官方停课', '其它'],
  'PA0016': ['电话', '微信', '抖音', '邮件', '短信', '面谈', '其它'],
  'PA0017': ['活动', '转介绍', '地推', '赛事', '其它'],
  'PA0018': ['大众点评', '抖音', '快手', '其它'],
  'PA0019': ['未分配', '公有', '私有', '签约客户'],
  'PA0020': ['启用', '停用'],
  'PA0021': ['APP', '微信公众号', '小程序'],
  'PA0022': ['String', 'Number', 'Object', 'Array'],
  'PA0023': ['GET', 'PUT', 'POST', 'DELETE'],
  'PA0024': ['普通查询', 'KEY查询', '认证查询', '添加', '修改', '删除'],
  'PA0025': { 0: '草稿', 10: '启用', 20: '禁用' },
  'PA0026': { 0: '草稿', 10: '正常', 20: '转校' },
  'PA0027': { 0: '草稿', 10: '在岗', 20: '休假' },
  'PA0028': { 0: '草稿', 10: '发布中', 20: '未发布' },
  'PA0029': { 0: '草稿', 10: '未排课', 20: '已排课' },
  'PA0030': { 0: '草稿', 10: '潜在客户', 20: '意向客户', 30: '签约客户' },
  'PA0031': ['上午', '下午'],
  'PA0032': ['00:00', '00:30', '01:00', '01:30', '02:00', '02:30', '03:00', '03:30', '04:00', '04:30', '05:00', '05:30', '06:00', '06:30', '07:00', '07:30', '08:00', '08:30', '09:00', '09:30', '10:00', '10:30', '11:00', '11:30', '12:00', '12:30', '13:00', '13:30', '14:00', '14:30', '15:00', '15:30', '16:00', '16:30', '17:00', '17:30', '18:00', '18:30', '19:00', '19:30', '20:00', '20:30', '21:00', '21:30', '22:00', '22:30', '23:00', '23:30'],
  'PA0033': ['00:00', '01:00', '02:00', '03:00', '04:00', '05:00', '06:00', '07:00', '08:00', '09:00', '10:00', '11:00', '12:00', '13:00', '14:00', '15:00', '16:00', '17:00', '18:00', '19:00', '20:00', '21:00', '22:00', '23:00'],
  'PA0034': ['00:00', '02:00', '04:00', '06:00', '08:00', '10:00', '12:00', '14:00', '16:00', '18:00', '20:00', '22:00'],
  'PA0035': ['00', '01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23'],
  'PA0036': ['00', '01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30', '31', '32', '33', '34', '35', '36', '37', '38', '39', '40', '41', '42', '43', '44', '45', '46', '47', '48', '49', '50', '51', '52', '53', '54', '55', '56', '57', '58', '59'],
  'PA0037': ['消费者', '员工', '教练', '其它'],
  'PA0038': ['O型', 'A型', 'B型', 'AB型', '其它'],
  'PA0039': ['普通', '白金', '翡翠', '钻石', '皇冠'],
  'PA0040': ['汉族', '壮族', '回族', '满族', '维吾尔族', '苗族', '彝族', '土家族', '蒙古族', '侗族', '布依族', '瑶族', '白族', '朝鲜族', '哈尼族', '黎族', '哈萨克族', '傣族', '其它', '香港', '澳门', '台湾', '国外'],
  'PA0041': ['北京', '天津', '上海', '重庆', '河北', '山西', '辽宁', '吉林', '黑龙江', '江苏', '浙江', '安徽', '福建', '江西', '山东', '河南', '湖北', '湖南', '广东', '海南', '四川', '贵州', '云南', '陕西', '甘肃', '青海', '台湾', '内蒙', '广西', '西藏', '宁夏', '新疆', '香港', '澳门', '外籍'],
  'PA0042': ['官方自营', '区域授权', '合作伙伴'],
  'PA0043': {
    110: '足球 SOCCER',
    120: '篮球 BASKETBALL',
    130: '游泳 SWIM',
    140: '美式橄榄球 AMERICAN FOOTBALL',
    150: '棒球 BASEBALL',
    160: '高尔夫 GOLF',
    170: '体适能 MULTISPORT',
    180: '活动商品',
    190: '赛事商品',
    200: '教练员培训',
    210: '普通商品',
    220: '短期营商品'
  },
  'PA0044': { 0: '离职', 1: '在职' },
  'PA0045': [
    {
      label: '足球 SOCCER',
      value: 110
    },{
      label: '篮球 BASKETBALL',
      value: 120
    },
    {
      label: '游泳 SWIM',
      value: 130
    },
    {
      label: '美式橄榄球 AMERICAN FOOTBALL',
      value: 140
    },
    {
      label: '棒球 BASEBALL',
      value: 150
    },
    {
      label: '高尔夫 GOLF',
      value: 160
    },
    {
      label: '体适能 MULTISPORT',
      value: 170
    },
    {
      label: '活动商品',
      value: 180
    },
    {
      label: '赛事商品',
      value: 190
    },
    {
      label: '教练员培训',
      value: 200
    },
    {
      label: '普通商品',
      value: 210
    },
    {
      label: '短期营商品',
      value: 220
    }
  ],
  'PA0046': [{
    label: 0,
    value: '上架'
  },{
    label: 1,
    value: '下架'
  }],
  'PA0047': [
    {
      label: '上海校区',
      value: 10000,
      children: [
        {
          label: '静安校区',
          value: 10001,
          children: [
            {
              label: '静安训练中心',
              value: 10002
            }
          ]
        },
        {
          label: '闵行校区',
          value: 10003,
          children: [{
            label: '闵行训练中心',
            value: 10004
          }]
        }
      ]
    },
    {
      label: '北京校区',
      value: 10005,
      children: [{
        label: '北京嘉里中心',
        value: 10006
      }
      ]
    },
    {
      label: '贵州省校区',
      value: 10007,
      children: [{
        label: '贵阳市校区',
        value: 10008,
        children: [
          {
            label: '贵州训练中心',
            value: 10009
          }
        ]
      }]
    },
    {
      label: '香港校区',
      value: 10010,
      children: [{
        label: '香港训练中心',
        value: 10011
      }]
    },
    {
      label: '测试校区（省)',
      value: 90000,
      children: [
        {
          label: '测试省属培训中心1',
          value: 90001
        },
        {
          label: '测试校区（市）',
          value: 90002,
          children: [
            {
              label: '测试市属培训中心1',
              value: 90003
            },
            {
              label: '测试校区1（县)',
              value: 90004,
              children: [
                {
                  label: '测试培训中心11',
                  value: 90005
                },
                {
                  label: '测试培训中心12',
                  value: 90006
                }
              ]
            },
            {
              label: '测试校区2（县)',
              value: 90007,
              children: [{
                label: '测试培训中心21',
                value: 90008
              },
              {
                label: '测试培训中心22',
                value: 90009
              }
              ]
            }
          ]
        }
      ]
    },
    {
      label: '测试总部直营校区',
      value: 90010,
      children: [
        {
          label: '测试直营校区1',
          value: 90011
        },
        {
          label: '测试直营校区2',
          value: 90012
        }
      ]
    }
  ],
  'PA0049': [
    {value: null, label: '全部'},{value: 0, label: '草稿'}, {value: 10, label: '上架审核中'},  {value:20, label: '驳回'},  {value: 30, label: '已上架'}, {value: 40, label: '下架'}, 
  ],

  'PA0051': [
    {value: 10, label: '上架审核中'},
    {value: 20, label: '驳回'},
    {value: 30, label: '已上架'},
    {value: 40, label: '下架'},
  ],

  'PA0050': [
    {
      label: '足球 SOCCER',
      value: 110
    },{
      label: '篮球 BASKETBALL',
      value: 120
    },
    {
      label: '游泳 SWIM',
      value: 130
    },
    {
      label: '美式橄榄球 AMERICAN FOOTBALL',
      value: 140
    },
    {
      label: '棒球 BASEBALL',
      value: 150
    },
    {
      label: '高尔夫 GOLF',
      value: 160
    },
    {
      label: '体适能 MULTISPORT',
      value: 170
    }],

    'PA0051': [
      {value: 10, label: '未付款'},
      {value: 20, label: '已付款'},
      {value: 30, label: '已排课'},
      {value: 40, label: '已结课'},
    ],

    'PA0053':[
      {label:'电话',value:'电话'},
      {label:'微信',value:'微信'},
      {label:'抖音',value:'抖音'},
      {label:'邮件',value:'邮件'},
      {label:'短信',value:'短信'},
      {label:'面谈',value:'面谈'},
      {label:'其他',value:'其他'},
    ]
}
